# Energy Analysis Zone Heating Air Temperature Property

Source: https://www.revitapidocs.com/2026/81d52daa-1c05-570e-0508-6953c04bfc99.htm

---

| Energy Analysis Zone Heating Air Temperature Property |
| --- |

The cooling air temperature in unit Kelvin (K).
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double HeatingAirTemperature { get; }
```

```
Public ReadOnly Property HeatingAirTemperature As Double
	Get
```

```
public:
property double HeatingAirTemperature {
	double get ();
}
```

```
member HeatingAirTemperature : float with get
```

#### Property Value

Double See Also

#### Reference

EnergyAnalysisZone Class Autodesk.Revit.DB.Analysis Namespace